"""
재귀함수
1) 팩토리얼
factorial(n) = n*factorial(n-1)
2) 파보나치 수열
fibonacci
>>>problem>>>
문제들이 많다
unboundlocalerror
-> 지역변수 전역변수 문제! local변수에서 오는 오류를 말한다
>>>solution>>>
메모화

"""

"""
lambda/ tuple, with구문
• 튜플 (tuple) • 함수와 함께 많이 사용되는 리스트와 비슷한 자료형으로, 한번 결정된 요소를바꿀수없다는점이리스트와다름
• 람다 (lambda) • 매개변수로 함수를 전달하기 위해 함수 구문을 작성하는 것이 번거롭 고코드낭비라생각될때함수를간단하고쉽게선언하는방법

@튜플
• 리스트와유사한자료형 • 한번결정된요소는바꿀수없음


@람다 aka 일급함수
* 일급함수란?
: 함수를 다른 변수와 동일하게 다루는 언어는 일급 함수를 가졌다고 표현
* 람다란?
: 1회성으로 함수를 선언할 때 사용한다
: 대부분의 언어들은 이름없이 define할때 람다 식을 많이 사용한다
파이썬에서는 lambda라는 키워드를 사용한다


"""


